#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.api.kubernetes_deployment.api must be replaced
-/+ resource "kubernetes_deployment" "api" {
      ~ id = "default/api" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 2 -> (known after apply)
          - labels           = {} -> null
            name             = "api"
            namespace        = "default"
          ~ resource_version = "1538129" -> (known after apply)
          ~ self_link        = "/apis/apps/v1/namespaces/default/deployments/api" -> (known after apply)
          ~ uid              = "6de69a0d-79eb-4fbf-8a86-6a865140fef9" -> (known after apply)
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
            replicas                  = 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "api"
                }
            }

          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                    labels           = {
                        "app" = "api"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = false -> null
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                    restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                      - args                     = [] -> null
                      - command                  = [] -> null
                      ~ image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:f33f14ee8963669a55372e7b8e63ec1503b22cba" -> "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:latest"
                      ~ image_pull_policy        = "IfNotPresent" -> (known after apply)
                        name                     = "api"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                      ~ env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                      ~ env {
                            name = "DATABASE_URL"

                            value_from {

                                secret_key_ref {
                                    key  = "connection_string"
                                    name = "api-database-credentials"
                                }
                            }
                        }
                        env {
                            name  = "LANGUAGE_SERVICE_URL"
                            value = "http://language-service.default.svc.cluster.local:8000"
                        }
                      ~ env {
                            name = "SECRET_KEY_BASE"

                            value_from {

                                secret_key_ref {
                                    key  = "secret_key_base"
                                    name = "api-secret-key-base"
                                }
                            }
                        }

                      ~ liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 60
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                          ~ http_get {
                                path   = "/health"
                                port   = "4000"
                                scheme = "HTTP"
                            }
                        }

                      ~ port {
                            container_port = 4000
                          - host_port      = 0 -> null
                            protocol       = "TCP"
                        }

                      ~ readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 60
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                          ~ http_get {
                                path   = "/health"
                                port   = "4000"
                                scheme = "HTTP"
                            }
                        }

                      ~ resources {
                          ~ limits {
                              + cpu    = (known after apply)
                                memory = "500Mi"
                            }

                          ~ requests {
                              + cpu    = (known after apply)
                                memory = "100Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }

                  + init_container { # forces replacement
                      + command                  = [
                          + "bin/api",
                          + "eval",
                          + "'Api.Release.migrate'",
                        ]
                      + image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:latest"
                      + image_pull_policy        = (known after apply)
                      + name                     = "api"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + env {
                          + name = "DATABASE_URL"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "connection_string"
                                  + name = "api-database-credentials"
                                }
                            }
                        }
                      + env {
                          + name  = "AUTH_TOKEN"
                          + value = "none"
                        }
                      + env {
                          + name  = "LANGUAGE_SERVICE_URL"
                          + value = "none"
                        }
                      + env {
                          + name  = "SECRET_KEY_BASE"
                          + value = "none"
                        }

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
